// 本地dogs JSON数据
var dogs_json = 
[
    {
        "cname": "吉娃娃",
        "description": "吉娃娃是目前人们所知道最古老的犬种之一，原产于美洲，和墨西哥的古老文明有深厚而密切的关系。吉娃娃属小型犬种里最小型，优雅、警惕、动作迅速，以匀称的体格和娇小的体型广受人们的喜爱。它们是相当受欢迎的狗狗，功用也相当广泛－它们可以是宗教的守护者，也是平民的好伴侣，上至贵族下至百姓，不分等级不分贵贱，吉娃娃是大家的好朋友。它不喜欢外来的同品种的狗。有和梗类相似的特点。精力充沛。体型较小，适合家养。",
        "link": "https://baike.baidu.com/item/%E5%90%89%E5%A8%83%E5%A8%83/124178",
        "label": "n02085620",
        "ename": "chihuahua"
    },
    {
        "cname": "日本狆",
        "description": "狆（日语：狆，英语：Japanese Chin）是原产于日本的一种小型犬。头大、宽且平。鼻子宽而且短，鼻梁明显，鼻子与眼睛在一个水平线上，黑亮的眼睛大又圆，隔着鼻子相对应。两只三角形的耳朵，披着长长的毛发对称。\n\n地垂落着，展示著仲狗的美丽与可爱。此种狗身体呈方形，颈短、上仰，背短且直，被毛丰富、长又直，如丝质般下垂。\n\n公元732年，朝鲜王室将日本狆的祖先（中国的拉萨犬）送到日本宫庭，后来这种犬在日本繁衍。在19世纪时。此种狗出口到美国和英格兰，经过育种家多年的繁育，目前分布较广。日本狆姿态优雅，步态轻盈有弹性。性格坚韧、活泼、机警，有些闹。忠于主人，不信任陌生人。",
        "link": "https://zh.wikipedia.org/wiki/%E6%97%A5%E6%9C%AC%E7%8B%86",
        "label": "n02085782",
        "ename": "japanese spaniel"
    },
    {
        "cname": "马尔济斯犬",
        "description": "马尔济斯犬，英文名Maltese，又称马尔他犬，或译成“摩天使”。身高为20－22厘米，体重2－3千克，是欧洲最古老的犬种，原产于地中海的英国属地－马尔他岛，而得此名。\n马尔济斯犬迄今已有近3000年的历史，在古代便以其端庄高雅的姿态而深受贵妇们的娇宠。在目前犹存的地中海沿岸的工艺品和美术作品中，常可见到马尔济斯犬栩栩如生的艺术形象。",
        "link": "https://baike.baidu.com/item/%E9%A9%AC%E5%B0%94%E6%B5%8E%E6%96%AF%E7%8A%AC/8208051?fromtitle=Maltese%20Dog&fromid=11289877&fr=aladdin",
        "label": "n02085936",
        "ename": "maltese dog"
    },
    {
        "cname": "北京狗",
        "description": "北京狗又称狮子狗（英语：Pekingese），是一种小型的宠物狗，来自中国，是很受人喜爱的贵族宠物。它天性活泼，驯养它使一些人获得乐趣。这种狗喜欢家庭环境和整洁的室外环境，在灯下它的眼睛闪闪发亮。\n\n中国人也叫它们为福狗，许多艺术作品里描画它们，受到广泛的推崇。古代中国由于不出产真正的狮子，该种狗又近似西方叙述中的狮子，因此工匠就依照北京狗的样貌制作石狮子及醒狮，所以被认为是守护神。",
        "link": "https://zh.wikipedia.org/wiki/%E7%8B%AE%E5%AD%90%E7%8B%97",
        "label": "n02086079",
        "ename": "pekinese"
    },
    {
        "cname": "西施犬",
        "description": "（原称：狮子狗）是原产西藏的拉萨犬（Lhasa Apso， 西藏狮子狗) 与中国宫廷内犬种混合所产生之混合种，两者常被混淆，即使在美国犬之协会对于血统介定之后，在民间仍时常被混淆。混称或误称的原因就在于其原本近似的外观，也就是狮子般的长毛外貌。\n\n狮子狗原种为拉萨犬，早先为西藏喇嘛教僧侣豢养于寺中，作为警示犬用，后进贡至中国宫廷，亦称狮子狗，又与宫内另一种长毛短鼻小白狗（北京狗）的犬种混合，后代与原种两者外型颇多类似，常被混淆，都称成为狮子狗。因此，“西施”虽为中文汉语，但其实并非此犬种原来之中文汉语名，汉语原称应为“狮子狗”。西方人将“狮子”汉语以威妥玛罗马字音拼写，为 Shih Tzu， 原即为汉音“狮子”，战后多年，此犬种再由外国引进自台湾时，或因繁殖者背景，或因行销商业因素，被译做“西施”。西施犬的身高都在27公分以下，体重为4公斤至7公斤。",
        "link": "https://zh.wikipedia.org/wiki/%E8%A5%BF%E6%96%BD%E7%8A%AC",
        "label": "n02086240",
        "ename": "shih tzu"
    },
    {
        "cname": "布伦海姆狗",
        "description": "",
        "link": "",
        "label": "n02086646",
        "ename": "blenheim spaniel"
    },
    {
        "cname": "蝴蝶犬",
        "description": "蝴蝶犬（法语：Papillon，名称起源于法语单词“蝴蝶”），16世纪起源于西班牙，也有人认为[谁？]起源于法国。身高28厘米以下，体重3.6～4.5公斤，寿命10-14岁，体高20~28cm。毛色有黑色和白色、褐色和白色、或白色和黑色带有棕褐色斑块。该犬两耳直立外展，酷似蝴蝶的翅膀而得名。该犬性格平和，活泼、顺从、适应性强，适合作伴侣犬。性格上，友善开朗，优雅美丽。",
        "link": "https://zh.wikipedia.org/wiki/%E8%9D%B4%E8%9D%B6%E7%8A%AC",
        "label": "n02086910",
        "ename": "papillon"
    },
    {
        "cname": "英国玩具梗",
        "description": "别名曼彻斯特玩具梗(Toy Manchester Terrier),是曼彻斯特梗的迷你型。由已经绝种的黑褐梗和意大利灵缇混合血统而形成。它的身体形状毛色与曼彻斯特梗十分相似，它们的区别在于英国玩具梗体型比较小，耳朵从不被人工修剪，而且直立（曼彻斯特梗的耳朵是向前折垂的）。",
        "link": "https://baike.baidu.com/item/%E8%8B%B1%E5%9B%BD%E7%8E%A9%E5%85%B7%E6%A2%97/568287?fr=aladdin",
        "label": "n02087046",
        "ename": "toy terrier"
    },
    {
        "cname": "罗得西亚脊背犬",
        "description": "罗得西亚背脊犬英文名Rhodesian Ridgeback，因为其能够捕猎狮子，又叫猎狮犬。罗德西亚脊背犬强壮、灵活，跑动速度很快。它有高贵的气质，对主人极为忠诚，会和陌生人保持一定的距离。这个品种的显著性是背部有脊，脊呈由背毛逆向生长而形成的。脊线清晰分明，逐渐变细，呈放射状。脊起始于肩后，延续到臀部两个突出点之间，两突出点(crowns)彼此相对，突出点下缘超过脊线1/3处。",
        "link": "https://baike.baidu.com/item/%E7%BD%97%E5%BE%97%E8%A5%BF%E4%BA%9A%E8%84%8A%E8%83%8C%E7%8A%AC",
        "label": "n02087394",
        "ename": "rhodesian ridgeback"
    },
    {
        "cname": "阿富汗猎狗",
        "description": "阿富汗猎狗（Afghan Hound）是一种猎犬，也是最古老的狗品种。阿富汗猎狗外表厚实，细腻，柔滑，它的尾巴在最后一环卷曲。又名588、黑沙第一球女。\n\n阿富汗猎狗生存于伊朗，阿富汗东部的寒冷山上，阿富汗猎狗最初是用来狩猎野兔和瞪羚。阿富汗猎狗其他名称包含巴尔赫塔子库奇猎犬，猎犬，俾路支猎犬，喀布尔猎犬，或非洲猎犬。",
        "link": "https://zh.wikipedia.org/wiki/%E9%98%BF%E5%AF%8C%E6%B1%97%E7%8D%B5%E7%8B%97",
        "label": "n02088094",
        "ename": "afghan hound"
    },
    {
        "cname": "巴吉度猎犬",
        "description": "巴吉度猎犬（法语：Basset hound）是一种短腿的犬种，属于猎犬家族。\n\n法国巴吉度猎犬以狩猎兔和野兔为目的。巴吉度猎犬嗅觉跟踪能力仅次于血𤟥，常被当成警犬来训练。共有6种获认可的法国巴吉度猎犬 。",
        "link": "https://zh.wikipedia.org/wiki/%E5%B7%B4%E5%90%89%E5%BA%A6%E7%8D%B5%E7%8A%AC",
        "label": "n02088238",
        "ename": "basset"
    },
    {
        "cname": "小猎犬",
        "description": "小猎犬（英语：Beagle），又称猎兔犬、小猎兔犬，也音译为米格鲁、比格犬，是一种小型至中型的犬种。在分类上属于猎犬，它的外观近似猎狐犬，但是体形较小。\n\n小猎犬最早用于狩猎，现今在世界各地受到许多人的欢迎，被当成家庭宠物。美国漫画《花生漫画》中的主角史努比，被认为可能是全世界最出名的虚构小猎犬。",
        "link": "https://zh.wikipedia.org/wiki/%E5%B0%8F%E7%8D%B5%E7%8A%AC",
        "label": "n02088364",
        "ename": "beagle"
    },
    {
        "cname": "寻血猎犬",
        "description": "寻血猎犬（Bloodhound）是一种大型猎犬。\n\n寻血猎犬最初以狩猎鹿和野猪为繁殖目的，而且从中世纪起还用于跟踪人类，现在大部分专门用于跟踪。寻血猎犬是圣休伯特在比利时饲养猎犬的后裔。\n\n寻血猎犬以辨别人体气味而著名，甚至在几天，或很远的距离，也可以跨越水泽。寻血猎犬有异常敏锐的嗅觉，加上强大和顽强的跟踪本能。",
        "link": "https://zh.wikipedia.org/wiki/%E5%B0%8B%E8%A1%80%E7%8D%B5%E7%8A%AC",
        "label": "n02088466",
        "ename": "bloodhound"
    },
    {
        "cname": "布鲁克浣熊猎犬",
        "description": "布鲁克浣熊猎犬，起源于路易斯安那。吻突的轮廓为长为方形，宽而深。圆圆的大眼睛是深棕色的。耳朵薄长的位置得很低。腿很直，尾巴高，形成一个点。后肢很长，肌肉发达。",
        "link": "https://baike.baidu.com/item/%E5%B8%83%E9%B2%81%E5%85%8B%E6%B5%A3%E7%86%8A%E7%8C%8E%E7%8A%AC",
        "label": "n02088632",
        "ename": "bluetick"
    },
    {
        "cname": "黑褐猎浣熊犬",
        "description": "黑褐色猎浣熊犬毛色绝大部分是黑色，其中还带有大约10-15%的棕褐色斑纹。由于它们经常将浣熊赶上树去，因此也被称为“赶上树”猎犬。猎人根据其不同的吠声来判别和辨识它们。完全依靠嗅觉来执行任务，非常有力的、有节奏的步伐使他具有很快的速度。",
        "link": "https://baike.baidu.com/item/%E9%BB%91%E8%A4%90%E7%8C%8E%E6%B5%A3%E7%86%8A%E7%8A%AC",
        "label": "n02089078",
        "ename": "black and tan coonhound"
    },
    {
        "cname": "赶上树竞走者猎浣熊犬",
        "description": "上树竞走者猎浣熊犬，原产地美国，起源于19世纪。 品种祖先来源于英国猎狐犬。在1742年和1770年维基尼亚州分别从英国进口了两批猎狐犬，成为本品种发展的基础。现今品种的主要培育者是美国肯塔基州的乔治·华盛顿·麦宾和W·沃尔克，19世纪时进行了杂交培育对品种发展影响深远。",
        "link": "https://baike.baidu.com/item/%E8%B5%B6%E4%B8%8A%E6%A0%91%E7%AB%9E%E8%B5%B0%E8%80%85%E7%8C%8E%E6%B5%A3%E7%86%8A%E7%8A%AC",
        "label": "n02089867",
        "ename": "walker hound"
    },
    {
        "cname": "英国猎狐犬",
        "description": "美国的猎狐运动几乎与大不列颠的猎狐运动在同一时期产生。在美国的犬展上或者其他地方我们所接触的猎狐犬被称为英国猎狐犬，虽然我们很难理解为什么被冠以那个名字而不被叫作猎狐梗即应称为英国猎狐梗)的原因。英国猎狐犬被精心饲养了150多年。由猎狐犬主人协会（英国）出版的优良品种登记簿可追溯到1800多年以前，并且对于每一个英国猎狐犬的主人来说，追溯它的血统是一件十分容易的事。英国猎狐犬的饲养掌握在猎犬的主人手中，这些人保留着最精心的饲养的记录。",
        "link": "https://baike.baidu.com/item/%E8%8B%B1%E5%9B%BD%E7%8C%8E%E7%8B%90%E7%8A%AC",
        "label": "n02089973",
        "ename": "english foxhound"
    },
    {
        "cname": "瑞德朋猎浣熊犬",
        "description": "瑞德朋猎浣熊犬英文名称：Redbone Coonhound属于大型群猎犬。原产地美国，起源于18世纪，性情温顺。头部颅骨适度宽阔，眼睛深棕色到淡褐色，肩整洁，肌肉丰富，足部紧凑，猫足，披毛短而光滑，紧密丰富。",
        "link": "https://bkso.baidu.com/item/%E7%91%9E%E5%BE%B7%E6%9C%8B%E7%8C%8E%E6%B5%A3%E7%86%8A%E7%8A%AC",
        "label": "n02090379",
        "ename": "redbone"
    },
    {
        "cname": "苏俄牧羊犬",
        "description": "苏俄猎狼犬（英语：Borzoi），亦音译作波索猎犬[1]，是一种视觉型狩猎犬种，拥有一身防寒的长被毛。苏俄猎狼犬的原产地是俄国，是来自中东地区传到北方大陆与当地长毛牧羊犬交配改良。苏俄猎狼犬的性情安静，机敏和警觉性很高，在训练苏俄猎狼犬要格外的小心。",
        "link": "https://zh.wikipedia.org/wiki/%E8%8B%8F%E4%BF%84%E7%89%A7%E7%BE%8A%E7%8A%AC",
        "label": "n02090622",
        "ename": "borzoi"
    },
    {
        "cname": "爱尔兰猎狼犬",
        "description": "爱尔兰猎狼犬，英语：Irish Wolfhound）源自爱尔兰的犬种，驯养做为打猎用。名字起源于驯养的目的（猎狼）而不是外表。 这种狗是世界上最高的狗。 ",
        "link": "https://zh.wikipedia.org/wiki/%E6%84%9B%E7%88%BE%E8%98%AD%E7%8D%B5%E7%8B%BC%E7%8A%AC",
        "label": "n02090721",
        "ename": "irish wolfhound"
    },
    {
        "cname": "意大利灵缇犬",
        "description": "产于意大利 。这种犬在过去是最小型猎犬，大多用它猎兔、猎野鸡，因其小巧可爱逐渐成为家庭玩赏犬。意大利灵缇的最高崇拜者是普鲁士国王弗德里克二世，这位帝国皇帝为 所有死去意大利灵缇建立坟墓，并且把自己也葬在意大利灵缇是坟墓中。著名小说家保罗·杜普莱西斯，也在去世时与自己意大利灵缇安葬在一起。可见意大利灵缇是何种地位。这种犬在美国和欧洲有众多爱好者，至今不衰。",
        "link": "https://baike.baidu.com/item/%E6%84%8F%E5%A4%A7%E5%88%A9%E7%81%B0%E7%8B%97?fr=aladdin#2",
        "label": "n02091032",
        "ename": "italian greyhound"
    },
    {
        "cname": "惠比特犬",
        "description": "惠比特犬是真正的运动型猎犬，中型视觉猎犬，能以最少的动作，跑完最大的距离。给人的印象是漂亮而和谐，肌肉发达，强壮而有力，外形是极度高雅优美。呈流线型的体形是速度的要求。这种犬原产英国，大部分在俄罗斯。它四肢修长，瘦小柔软的身体，是灵缇犬的缩小型。\n惠比特在国内经常比用来抓兔子，以及猎获小型猎物，以及参加各种赛跑比赛。",
        "link": "https://baike.baidu.com/item/%E6%83%A0%E6%AF%94%E7%89%B9%E7%8A%AC",
        "label": "n02091134",
        "ename": "whippet"
    },
    {
        "cname": "伊比莎猎犬",
        "description": "伊比莎猎犬IbizanHound，别名：伊维萨猎犬、伊比桑猎犬。它轮廓鲜明，大而直立的耳朵，明快的颜色是他独特的外貌特征。除了耳朵，身上没有过分或夸张的部位。他有能力从静止状态跃起很高的距离。",
        "link": "https://baike.baidu.com/item/%E4%BC%8A%E6%AF%94%E8%8E%8E%E7%8C%8E%E7%8A%AC",
        "label": "n02091244",
        "ename": "ibizan hound"
    },
    {
        "cname": "挪威猎麋犬",
        "description": "挪威猎麋犬原产地挪威，起源于11世纪。它是非常勇敢的灰色猎犬，整体来看，它身材中等，轮廓呈正方形，身体的结构结实而牢固，衔接紧凑，比例协调。气质大胆而活跃，一个有主见的守卫犬，但通常都很友善，具有非常高贵而独立的品质。依靠嗅觉工作。\n挪威猎麋犬是非常勇敢的灰色猎犬。从整体的外观来看，属于典型的北方狗，身材中等，轮廓呈正方形，身体的结构结实而牢固，衔接紧凑，比例协调。头部宽阔，耳朵竖立着，尾巴略向背后卷曲。浓厚而平顺的被毛呈灰色，显得那么的与众不同。作为优秀的猎犬，挪威猎麋犬活泼而有毅力，且非常勇敢，利用吠声把驼鹿或其他大型动物逼到绝路，并避开袭击。具有很强的耐力性，能够在恶劣的气候以及崎岖不平的陆地上进行长时间的工作。",
        "link": "https://baike.baidu.com/item/%E6%8C%AA%E5%A8%81%E7%8C%8E%E9%BA%8B%E7%8A%AC",
        "label": "n02091467",
        "ename": "norwegian elkhound"
    },
    {
        "cname": "奥达猎犬",
        "description": "奥达猎犬的英文名称为：Otterhound。奥达猎犬是一种高大的、被毛杂乱的猎犬。嗅觉极端灵敏，对气味好奇，性格和蔼的平静。奥达猎犬能在陆地和水中捕捉猎物，特别喜欢在水中玩耍。奥达猎犬是一种高大的、被毛杂乱的猎犬，壮丽的头部显示出巨大的力量和无比威严，结实的身躯和步幅很大的动作使他能长时间工作。他的嗅觉极端灵敏，对气味好奇，且能坚持研究。奥达猎犬能在陆地和水中捕捉猎物，结合了下列典型特征，大量粗糙的双层被毛；坚固的、有蹼的足爪。",
        "link": "https://baike.baidu.com/item/%E5%A5%A5%E8%BE%BE%E7%8C%8E%E7%8A%AC",
        "label": "n02091635",
        "ename": "otterhound"
    },
    {
        "cname": "萨路基猎犬",
        "description": "萨路基猎犬起源于东非的一种狗的品种，毛细而长，有种高雅的感觉。是狗种中最早被人类所饲养的品种之一，可以追溯到公元前2000多年前的埃及。\n\n在历史上，中国皇帝也曾饲养过此种犬种，宣德皇帝在1398－1435年间所饲养过，在12世纪左右引入欧洲。\n\n萨路基猎犬的跑步速度极快，也常被当作为是狩猎的伙伴。",
        "link": "https://zh.wikipedia.org/wiki/%E8%96%A9%E8%B7%AF%E5%9F%BA%E7%8D%B5%E7%8A%AC",
        "label": "n02091831",
        "ename": "saluki"
    },
    {
        "cname": "苏格兰猎鹿犬",
        "description": "苏格兰猎鹿犬被赞为“神所创造最完美的生物”，头部吻部呈锥形，反映出在血统上受灵提的影响，甚至被称作粗毛灵提。最初在苏格兰专门为猎鹿而培育，它身高力大，粗糙的毛皮可以抵挡恶劣的气候。现在除了狩猎之外还是很好的伴侣犬。",
        "link": "https://baike.baidu.com/item/%E8%8B%8F%E6%A0%BC%E5%85%B0%E7%8C%8E%E9%B9%BF%E7%8A%AC",
        "label": "n02092002",
        "ename": "scottish deerhound"
    },
    {
        "cname": "威玛猎犬",
        "description": "威玛猎犬(Weimaraner)又称威玛犬，德国魏玛犬，魏玛沃斯特亨德犬，魏玛犬。\n威玛猎犬是一种中型的灰色犬，形态优雅。它非常美丽，外貌是贵族化的。有非常快的速度，动作十分优雅、美观，毅力非常强，头脑机智、灵敏，身材非常匀称。从它的身体结构来看，它是可以长时间、用非常快的速度来完成它的工作，这说明它具有非常好的耐力。",
        "link": "https://baike.baidu.com/item/%E5%A8%81%E7%8E%9B%E7%8C%8E%E7%8A%AC",
        "label": "n02092339",
        "ename": "weimaraner"
    },
    {
        "cname": "斯塔福郡斗牛㹴",
        "description": "在斯塔福郡斗牛㹴（英: Staffordshire Bull Terrier，非正式：Staffie, Stafford, Staffy or Staff）为比特斗牛㹴的一种，是一个中型的短涂层品种犬这是一个英格兰狗，第五个最流行的品种。",
        "link": "https://zh.wikipedia.org/wiki/%E6%96%AF%E5%A1%94%E7%A6%8F%E9%83%A1%E9%AC%A5%E7%89%9B%E3%B9%B4",
        "label": "n02093256",
        "ename": "staffordshire bullterrier"
    },
    {
        "cname": "美国史特富郡梗",
        "description": "美国史特富郡梗给人的印象一种是力气很大，肌肉发达但同时又很敏捷、优雅的狗。对周围环境抱有很大的热情。其轮廓比较矮胖，其勇气是众所周知的。",
        "link": "https://baike.baidu.com/item/%E7%BE%8E%E5%9B%BD%E5%8F%B2%E7%89%B9%E5%AF%8C%E9%83%A1%E6%A2%97",
        "label": "n02093428",
        "ename": "american staffordshire terrier"
    },
    {
        "cname": "贝林登梗",
        "description": "贝林登梗犬的名称源于原产地，于19世纪初由刚毛的梗犬与惠比特犬和单第丁蒙梗犬交配，又加入有贵宾犬血统繁衍而成，未改良前的贝林登梗犬比现在的大身体重，改良后的贝林登梗犬身高脚长，具有美丽外表，别以为它不具活动力，它的速度、活力、耐力，受到当时狩猎者的喜爱。\n",
        "link": "https://baike.baidu.com/item/%E8%B4%9D%E6%9E%97%E7%99%BB%E6%A2%97%E7%8A%AC/10601013?fromtitle=%E8%B4%9D%E6%9E%97%E7%99%BB%E6%A2%97&fromid=3757071",
        "label": "n02093647",
        "ename": "bedlington terrier"
    },
    {
        "cname": "边境㹴",
        "description": "边境㹴（英语：Border Terrier）是一种来自英国的㹴犬，体型细小，成犬身高（至肩膊）28-41厘米，重5.2-7.0公斤，与丹迪丁蒙㹴和贝林登㹴有共同祖先。",
        "link": "https://zh.wikipedia.org/wiki/%E9%82%8A%E5%A2%83%E3%B9%B4",
        "label": "n02093754",
        "ename": "border terrier"
    },
    {
        "cname": "凯利蓝㹴",
        "description": "凯利蓝㹴，又称爱尔兰蓝㹴，是㹴犬的一种，起源于19世纪爱尔兰的凯里郡。蓝色皮毛是它的典型特征。凯利蓝㹴是爱尔兰的国犬。",
        "link": "https://zh.wikipedia.org/wiki/%E5%87%AF%E5%88%A9%E8%93%9D%E3%B9%B4",
        "label": "n02093859",
        "ename": "kerry blue terrier"
    },
    {
        "cname": "爱尔兰㹴",
        "description": "爱尔兰㹴（爱尔兰语：An Madra Gearr）是爱尔兰㹴的许多品种之一。爱尔兰梗被认为是最古老的㹴品种之一。在1873年都柏林狗展是第一个为爱尔兰㹴提供了一个单独的类别。由19世纪80年代，是爱尔兰猎犬中第四大最流行的品种在爱尔兰和英国。\n\n爱尔兰㹴是适合生活在农村和城市环境的狗。其身体轮廓呈方便奔跑的流线形。",
        "link": "https://zh.wikipedia.org/wiki/%E7%88%B1%E5%B0%94%E5%85%B0%E3%B9%B4",
        "label": "n02093991",
        "ename": "irish terrier"
    },
    {
        "cname": "诺福克梗",
        "description": "诺福克梗（英语：Norfolk Terrier）是一种来自英国的犬种。诺福克梗在1960年前同诺维奇梗被当为同一种狗。诺福克梗的耳朵向下而诺维奇梗的耳朵是向上的。两种梗的身形都很小。",
        "link": "https://zh.wikipedia.org/wiki/%E8%AF%BA%E7%A6%8F%E5%85%8B%E6%A2%97",
        "label": "n02094114",
        "ename": "norfolk terrier"
    },
    {
        "cname": "挪利其㹴",
        "description": "The Norwich Terrier is a breed of dog originating in the United Kingdom, and was bred to hunt small vermin or rodents. With a friendly personality, Norwich Terriers are today mostly a companion dog breed. One of the smallest terriers, these dogs are generally healthy, but are relatively rare, due in part to their low litter size and the common need for caesarian sections. Their drop-eared variety is the Norfolk Terrier.",
        "link": "https://en.wikipedia.org/wiki/Norwich_Terrier",
        "label": "n02094258",
        "ename": "norwich terrier"
    },
    {
        "cname": "约克夏㹴",
        "description": "约克夏㹴（约瑟爹利，Yorkshire Terrier），是小型的玩赏狗的一种。个性聪明又自信、警觉性高和友善之外又带点固执，一般都喜爱撒娇。由于行走时双脚会被华丽的长毛遮盖，就好像在自然移动一样，所以有着“会动的宝石”的美誉。",
        "link": "https://zh.wikipedia.org/wiki/%E7%B4%84%E5%85%8B%E5%A4%8F%E3%B9%B4",
        "label": "n02094433",
        "ename": "yorkshire terrier"
    },
    {
        "cname": "刚毛猎狐梗",
        "description": "刚毛猎狐梗为19世纪猎狐而产生的犬种，祖先包括了粗毛黑白梗及许多梗类血统。而短毛猎狐梗是由短毛黑白梗和米格鲁斗牛犬与灵缇配种产生的，此犬曾担任过军犬，并有过辉煌的纪录。刚毛猎狐“德勒马捷科”在一次世界大战时随英国近卫军征战，荣获服务勋章。刚毛猎狐梗极度聪明，有对新的事物充满好奇，所以只要是有趣的东西，它们很乐意去学习，并能轻松完成任务，了解常见的犬病及日常行为，可使犬更加健康的成长。",
        "link": "https://baike.baidu.com/item/%E5%88%9A%E6%AF%9B%E7%8C%8E%E7%8B%90%E6%A2%97",
        "label": "n02095314",
        "ename": "wire haired fox terrier"
    },
    {
        "cname": "湖畔梗",
        "description": "最初叫做佩特戴尔梗(The Patterdale Terrier),是在英国北部湖畔地区由贝德灵顿梗和老式英国刚毛梗交配发展而来的。原来有不少分枝，1912年归为一类。与威尔士梗相似但个体稍小。他的身躯深而且较窄，使他能顺利地钻进石洞，完成工作。他有足够长的腿，使他能适应各种崎岖的地形。",
        "link": "https://baike.baidu.com/item/%E6%B9%96%E7%95%94%E6%A2%97",
        "label": "n02095570",
        "ename": "lakeland terrier"
    },
    {
        "cname": "西里汉姆㹴",
        "description": "西里汉姆㹴 (Sealyham Terrier) 是起源于威尔士的罕见品种中型㹴，作为工作犬。主要是白色，19 世纪中期到后期在西里汉姆发展。\n\n第一次世界大战起，其数量已经显著下降，养犬俱乐部列为脆弱的本土品种；2008 年记录到历史最低登记数量，在英国只有 43 只。这个品种给予适当的培训后，适合当作家庭犬或工作犬。",
        "link": "https://zh.wikipedia.org/wiki/%E8%A5%BF%E9%87%8C%E6%B1%89%E5%A7%86%E3%B9%B4",
        "label": "n02095889",
        "ename": "sealyham terrier"
    },
    {
        "cname": "万能㹴",
        "description": "万能㹴（英语：Airedale Terrier，通常简称为“万能”），也叫宾利㹴，滨水㹴，是起源于河艾尔谷（戴尔），在英格兰约克郡的西部骑马品种的㹴类犬。传统上被称为“㹴之王”，因为它是世界上最大的㹴品种。在英国，这个品种也被用来作为战争犬，导盲犬和警犬。",
        "link": "https://zh.wikipedia.org/wiki/%E4%B8%87%E8%83%BD%E3%B9%B4",
        "label": "n02096051",
        "ename": "airedale"
    },
    {
        "cname": "凯恩梗",
        "description": "凯恩梗，原产地英国，起源于16世纪。活泼、惹人喜爱的凯恩梗属于工作梗中之最小型品种。凯恩(Cain)这个词是石堆的意思，苏格兰高地的一些石堆，是古代罗马人的墓志。凯恩梗即善于追踪那些在石堆里的老鼠，狐狸，有时追捕凶猛的欧洲猫。\n",
        "link": "https://baike.baidu.com/item/%E5%87%AF%E6%81%A9%E6%A2%97",
        "label": "n02096177",
        "ename": "cairn"
    },
    {
        "cname": "澳大利亚梗",
        "description": "澳大利亚梗(AustralianTerrier)又叫澳洲梗，此新品种是本世纪初期培养而成的，这种狗具有聪明而灵活的头脑，强健的身体，是伴侣犬与玩赏犬的最佳选择。",
        "link": "https://baike.baidu.com/item/%E6%BE%B3%E5%A4%A7%E5%88%A9%E4%BA%9A%E6%A2%97/395160?fromtitle=%E6%BE%B3%E6%B4%B2%E6%A2%97&fromid=7461914",
        "label": "n02096294",
        "ename": "australian terrier"
    },
    {
        "cname": "丹迪丁蒙梗",
        "description": "丹迪丁蒙梗，原产地英国，起源于17世纪。最古雅别致的宠物犬之一。许多宠物都是因饲养地或繁衍发展的地方而得名，丹第丁蒙更犬却是以著名作家瓦尔德·斯科特爵士（alter Scott）的作品中的主角名字来命名的。早在1700年代，苏格兰和英格兰的交界地区饲养的丹第丁蒙梗犬，就因为它能够捕食水獭和獾而名声在外，从而成为独特的一个品种。据信是苏格兰梗和斯凯梗交配产生的品种。",
        "link": "https://baike.baidu.com/item/%E4%B8%B9%E8%BF%AA%E4%B8%81%E8%92%99%E6%A2%97",
        "label": "n02096437",
        "ename": "dandie dinmont"
    },
    {
        "cname": "波士顿㹴",
        "description": "波士顿㹴，属于㹴犬的一种，源于美国波士顿，自1893年被美国犬业俱乐部（American Kennel Club，下文简称AKC）承认，属于非运动犬。\n颜色和标记是区分该品种和鉴定AKC标准的先决条件。它们的毛色应是黑、海豹色或有白色斑纹的。波士顿㹴个体隶属于中型犬，有一条短尾巴和竖立的耳朵。AKC的资料显示它们非常聪明，易于接受训练。友好但时而固执。尽管其少数能活到十几岁，但平均寿命仍为11至13岁。起初波士顿㹴是被当作捕鼠犬和伴侣犬的，但如今主要作为玩赏犬。在生物分类法中隶属犬科。\nAKC于2016年将波士顿㹴列为21大最受欢迎的犬种。",
        "link": "https://zh.wikipedia.org/wiki/%E6%B3%A2%E5%A3%AB%E9%A1%BF%E3%B9%B4",
        "label": "n02096585",
        "ename": "boston bull"
    },
    {
        "cname": "迷你雪纳瑞",
        "description": "迷你雪纳瑞（英语：Miniature Schnauzer，又称迷你史纳莎）是雪纳瑞家族中的小型犬种，于19世纪中后期产于德国。迷你雪纳瑞是由标准雪纳瑞和许多小型犬，包括贵宾犬 、迷你杜宾犬或是艾芬笃宾犬配种衍生而来。",
        "link": "https://zh.wikipedia.org/wiki/%E8%BF%B7%E4%BD%A0%E9%9B%AA%E7%B4%8D%E7%91%9E",
        "label": "n02097047",
        "ename": "miniature schnauzer"
    },
    {
        "cname": "大型雪纳瑞犬",
        "description": "大型雪纳瑞犬俗名里森雪纳瑞犬，英文名为Giant Schnauzer。原产地是德国，以胎生为繁殖方式，经常被用作工作犬培育。它聪明、宁静、稳重、易训，易和儿童为伴，能容忍儿童，可作温顺的伴侣犬。",
        "link": "https://baike.baidu.com/item/%E5%A4%A7%E5%9E%8B%E9%9B%AA%E7%BA%B3%E7%91%9E%E7%8A%AC",
        "label": "n02097130",
        "ename": "giant schnauzer"
    },
    {
        "cname": "标准雪纳瑞",
        "description": "标准雪纳瑞是一种精力充沛、体格魁梧的梗犬，发达的肌肉和充足的骨量构成了他坚强的体格；他的身高与体长的比例呈正方形。被毛浓密、粗硬且粗糙不平是这一品种非常重要的特点，他还长有弯弯的眉毛和刚毛的胡须，性情温顺，适合家养。雪纳瑞耳朵弯曲，耳壁内易生耳螨，所以雪纳瑞在幼犬时期就会做剪耳。缺陷：任何背离上述标准（精力充沛、活泼、正方形比例、刚毛）的现象都属于缺陷，在比赛中，将根据背离上述标准的程度进行扣分。",
        "link": "https://baike.baidu.com/item/%E6%A0%87%E5%87%86%E9%9B%AA%E7%BA%B3%E7%91%9E",
        "label": "n02097209",
        "ename": "standard schnauzer"
    },
    {
        "cname": "苏格兰梗犬",
        "description": "苏格兰梗（Scottish Terrier）是最原始的纯种高地犬。苏格兰梗活跃而自信，性格谨慎，但很难与其它犬只友好相处，有“顽固分子”的称号，因为它有时蛮横而且力气大，对其他狗则有攻击性，但是对人却友爱而温和。",
        "link": "https://baike.baidu.com/item/%E8%8B%8F%E6%A0%BC%E5%85%B0%E6%A2%97%E7%8A%AC",
        "label": "n02097298",
        "ename": "scotch terrier"
    },
    {
        "cname": "西藏㹴",
        "description": "西藏㹴（Tibetan Terrier）是一种中等体格的犬种，原产自中国西藏。尽管名为㹴犬，但它并非㹴犬组的成员。该犬种因与已知的㹴犬相似而被欧洲的发现者命名为西藏㹴犬。这个犬种的西藏名字是Tsang Apso，大致翻译为“产于乌思藏(\"Tsang\")的有杂毛和胡须 (\"apso\") 的犬”。一些年迈的旅行者称这只犬为Dokhi Apso或“户外的”Apso，指的是生活在户外的毛茸茸的或有胡须的此类工作犬。其在生物分类法中隶属犬科。",
        "link": "https://zh.wikipedia.org/wiki/%E8%A5%BF%E8%97%8F%E3%B9%B4",
        "label": "n02097474",
        "ename": "tibetan terrier"
    },
    {
        "cname": "澳大利亚丝毛梗",
        "description": "澳洲丝毛梗（Australian Silky Terrier）性格开朗活泼，有时很顽皮，是纯粹被人类用来做伴侣。此犬保持梗类活力充沛，自我主张强烈的特性。在澳洲也能发挥梗类追杀小动物的技能。丝毛梗可爱， 快活，聪明 ，陌生人靠近时，会有警戒心，为都市居民的理想看家犬或家庭犬。其体态娇小轻盈、机敏活泼，拥有典型的梗犬特点。",
        "link": "https://baike.baidu.com/item/%E6%BE%B3%E5%A4%A7%E5%88%A9%E4%BA%9A%E4%B8%9D%E6%AF%9B%E6%A2%97/546128?fromtitle=%E6%BE%B3%E6%B4%B2%E4%B8%9D%E6%AF%9B%E6%A2%97&fromid=1919616",
        "label": "n02097658",
        "ename": "silky terrier"
    },
    {
        "cname": "愛爾蘭軟毛梗",
        "description": "愛爾蘭軟毛梗是一種中等體型、勇敢、協調性很好的運動梗，身體輪廓呈正方形。他顯著的特點就在於其柔軟、絲狀、稍有波浪的被毛，柔和的小麥色，以及他特有的溫和氣質。這一品種要求身體結構和外表都適中，任何的誇張都是不必要的。他整個的氣質應該是警惕而快樂的動物，優雅、結實而且協調性好。產地是英國。",
        "link": "http://www.zwbk.org/zh-tw/Lemma_Show/236279.aspx",
        "label": "n02098105",
        "ename": "soft coated wheaten terrier"
    },
    {
        "cname": "西高地白㹴",
        "description": "西高地白梗（英语：West Highland White Terrier），㹴犬的一种，知名饲养犬种，因其独具特色的白色体毛闻名。其原产于苏格兰，最初被用于协助捕猎狐狸和獾。该品种曾被作为“白+黑”牌苏格兰威士忌和西莎牌狗粮的吉祥物 和多种商标。",
        "link": "https://zh.wikipedia.org/wiki/%E8%A5%BF%E9%AB%98%E5%9C%B0%E7%99%BD%E3%B9%B4",
        "label": "n02098286",
        "ename": "west highland white terrier"
    },
    {
        "cname": "拉萨犬",
        "description": "拉萨犬Lhasa Apso，是一种原产于西藏的小型犬，依据目前对国际间拉萨犬血统规范最完整的美国犬之俱乐部设定，拉萨犬雄性拉萨Apsos理想的肩高约为26-27公分（厘米），重约6.4至8.2公斤。 雌性略小，体重在5.4至6.4公斤之间。 品种标准要求深褐色的眼睛和黑色的鼻子，浅褐色的则有深棕色的鼻子。毛的质地浓密、厚重，非常致密。 他们有各种各样的颜色，包括黑色，白色，褐色、砖色和金黄色等。尾巴完整往背部倒卷。\n一般说法此犬种是由拉萨的喇嘛寺所豢养、培育，专属于布达拉宫中达赖喇嘛专属的珍贵犬种，然而在更早的历史上，此种犬只已存在王藩之中，因为一直属于禁宫国宝，因此直到19世纪末叶，甚至20世纪初期，这种狗对西藏当地一般民间来说仍非常神秘。",
        "link": "https://zh.wikipedia.org/wiki/%E6%8B%89%E8%96%A9%E7%8A%AC",
        "label": "n02098413",
        "ename": "lhasa"
    },
    {
        "cname": "平毛寻回犬",
        "description": "平毛寻回犬具有一个强烈的个人向往和一种令人喜欢的自我照顾能力。他是一种快乐、活泼的狗，表情聪明，线条整洁。它与众不同的、非常重要的特征是他的侧面轮廓（不论在运动中，还是站立着），平滑、轻松的动作，头部类型，被毛和特征，这些都是该品种独特的特征。",
        "link": "https://baike.baidu.com/item/%E5%B9%B3%E6%AF%9B%E5%AF%BB%E5%9B%9E%E7%8A%AC",
        "label": "n02099267",
        "ename": "flat coated retriever"
    },
    {
        "cname": "卷毛寻回犬",
        "description": "卷毛寻回犬，顾名思义，它的被毛是卷的。它的独立和冷静，使他从来不会显得羞怯，不会自得其乐。在犬展上，气质正确的卷毛寻回犬会坚定地站在自己的位置，服从性很好；在野外，卷毛寻回犬非常热情、稳固、天性勇敢；在家里，他显得平静而友善。卷毛寻回犬是最古老的寻回犬之一，拥有惊人的嗅觉和记忆力。",
        "link": "https://baike.baidu.com/item/%E5%8D%B7%E6%AF%9B%E5%AF%BB%E5%9B%9E%E7%8A%AC",
        "label": "n02099429",
        "ename": "curly coated retriever"
    },
    {
        "cname": "金毛寻回犬",
        "description": "金毛寻回犬（英语：Golden Retriever）是比较现代并很流行的狗的品种，是单猎犬，作为用来在猎捕野禽的寻回犬而培养出来的，游泳的续航力极佳。今天，它是最常见的家犬之一，因为它很容易养，有耐心并且对主人要求不多，只要定期的运动，食物和兽医体检就可以了。金毛寻回犬的独特之处在于它讨人喜欢的性格。",
        "link": "https://zh.wikipedia.org/wiki/%E9%87%91%E6%AF%9B%E5%AF%BB%E5%9B%9E%E7%8A%AC",
        "label": "n02099601",
        "ename": "golden retriever"
    },
    {
        "cname": "拉布拉多寻回犬",
        "description": "拉布拉多犬或称拉布拉多拾猎犬（简称拉布拉多；英语：Labrador Retriever）是一种中大型犬类，天生个性温和、活泼、没有攻击性和智能高，是适合被选作导盲犬或其他工作犬的狗品种，跟黄金猎犬、哈士奇并列三大无攻击性犬类之一。在美国犬业俱乐部中拉布拉多是目前登记数量最多的品种。 拉布拉多犬亦被广泛训练成导盲犬。",
        "link": "https://zh.wikipedia.org/wiki/%E6%8B%89%E5%B8%83%E6%8B%89%E5%A4%9A%E7%8A%AC",
        "label": "n02099712",
        "ename": "labrador retriever"
    },
    {
        "cname": "切萨皮克海湾寻回犬",
        "description": "切萨皮克海湾寻回犬（Chesapeake Bay Retriever）起源于英格兰，但关于它的发展没有完全和可靠的记载。这些犬性情聪明、快乐，并带有智慧的表情。而且经常被要求在一天内从海湾水中猎取100～200只水鸭。",
        "link": "https://baike.baidu.com/item/%E5%88%87%E8%90%A8%E7%9A%AE%E5%85%8B%E6%B5%B7%E6%B9%BE%E5%AF%BB%E5%9B%9E%E7%8A%AC/2684571?fromtitle=%E4%B9%9E%E6%B2%99%E6%AF%94%E5%85%8B%E7%8C%8E%E7%8A%AC&fromid=3793341",
        "label": "n02099849",
        "ename": "chesapeake bay retriever"
    },
    {
        "cname": "德国短毛指示犬",
        "description": "德国短毛指示犬的英文名为：German Shorthaired Pointer。它是一种友善、聪明、乐于助人的狗。给人的第一印象是热烈而渴望工作，没有任何神经不安或企图逃跑的迹象。",
        "link": "https://baike.baidu.com/item/%E5%BE%B7%E5%9B%BD%E7%9F%AD%E6%AF%9B%E6%8C%87%E7%A4%BA%E7%8A%AC",
        "label": "n02100236",
        "ename": "german short haired pointer"
    },
    {
        "cname": "维兹拉犬",
        "description": "维兹拉犬是一种中等体型的短毛猎犬，相貌和姿势高贵。精力充沛且结构轻盈一些比较好；被毛是有魅力的金锈色。这种狗在野外显得非常有力且驱动力强大，但在家庭中，却是容易调教的、挚爱的伴侣犬。它有良好的嗅觉，且接受训练的能力高于一般水平。善于指示猎物，又可寻取猎物。",
        "link": "https://baike.baidu.com/item/%E7%BB%B4%E5%85%B9%E6%8B%89%E7%8A%AC",
        "label": "n02100583",
        "ename": "vizsla"
    },
    {
        "cname": "英国蹲猎犬",
        "description": "英国蹲猎犬的英文名为English Setter。它仪表端庄，性情温和，最适宜作为小孩子们的忠实伙伴，也由于其美貌和温柔共存而颇受人们喜爱。现代的英格兰雪达犬可分为两种类型：一种生长于平狭高地(Laverack)，另一种活跃于田间（Llewelin），前者是伴侣犬和展览犬较为理想的候选品种，而后者在担当防卫的工作中常常倍受重用。",
        "link": "https://baike.baidu.com/item/%E8%8B%B1%E5%9B%BD%E8%B9%B2%E7%8C%8E%E7%8A%AC",
        "label": "n02100735",
        "ename": "english setter"
    },
    {
        "cname": "爱尔兰雪达犬",
        "description": "爱尔兰雪达犬是一种活跃的、贵族化的猎鸟犬，颜色是浓烈的红色，结构坚固，但很文雅。站立时，肩高超过2英尺，他拥有直、细腻、且有光泽的被毛，耳朵、胸部、尾巴和腿后面的毛发略长。在野外，爱尔兰雪达犬是动作迅速的猎手，在家庭里，他又是性情甜蜜，容易调教的伴侣适合与小孩做伴，经常梳理犬毛可是犬保持干净整洁的良好形象，也减少皮肤病的滋生。了解掌握常见的犬病对犬和养犬者都是很重要的。了解繁殖行为可是犬更好的繁殖后代。",
        "link": "https://baike.baidu.com/item/%E7%88%B1%E5%B0%94%E5%85%B0%E9%9B%AA%E8%BE%BE%E7%8A%AC",
        "label": "n02100877",
        "ename": "irish setter"
    },
    {
        "cname": "戈登蹲猎犬",
        "description": "戈登蹲猎犬属运动犬类，外观美丽，历史可以追溯到1620年，苏格兰品种。 速度不快，嗅觉能力强，耐力好，工作能力强。",
        "link": "https://baike.baidu.com/item/%E6%88%88%E7%99%BB%E8%B9%B2%E7%8C%8E%E7%8A%AC",
        "label": "n02101006",
        "ename": "gordon setter"
    },
    {
        "cname": "布列塔尼猎犬",
        "description": "布列塔尼猎犬 是一种紧凑，结合紧密的中型犬，外观是一种长腿狗，显得很敏捷，步幅非常大，结实、精力旺盛、积极、动作迅速，坚固而不笨拙，这就是不列塔尼猎犬。他可以没有尾巴或断尾，保留4英寸长。\n布列塔尼猎犬肩高约17.5英寸~20.5英寸，体重：体重约30~40磅，腿长而优美，体长等于肩高，体长是指从前胸到臀部的距离。\n布列塔尼猎犬 警惕而热烈，但带有猎鸟犬的柔和表情。",
        "link": "https://baike.baidu.com/item/%E5%B8%83%E5%88%97%E5%A1%94%E5%B0%BC%E7%8C%8E%E7%8A%AC",
        "label": "n02101388",
        "ename": "brittany spaniel"
    },
    {
        "cname": "克伦伯犬",
        "description": "克伦伯犬是一种长、矮、坚实的狗。沉重的眉毛，深深的胸部、笔直的前腿、有力的后躯，充足的骨量、和漂亮的足爪，使他有力量和耐力在追击时穿过浓密的灌木丛。他的白色被毛使他在猎枪射击范围内工作时，很容易被猎手看见。克伦伯犬的态度威严，表情象是在沉思，但与此同时，克伦伯犬也表现出喜爱工作和玩耍。克伦伯犬外形呈矩形，拥有沉重的骨骼结构，外貌显得非常有力。",
        "link": "https://baike.baidu.com/item/%E5%85%8B%E4%BC%A6%E4%BC%AF%E7%8A%AC",
        "label": "n02101556",
        "ename": "clumber"
    },
    {
        "cname": "史宾格犬",
        "description": "史宾格犬（英语：English Springer Spaniel）源于英国（早于1576年已有记载），为狩猎用的激飞猎犬，亦可作寻回犬使用。由于非常聪明、服从性高，而且嗅觉灵敏，被各地海关及警察机构训练成为专门搜索违禁品（毒品或爆炸品）的犬种。",
        "link": "https://zh.wikipedia.org/wiki/%E5%8F%B2%E8%B3%93%E6%A0%BC%E7%8A%AC",
        "label": "n02102040",
        "ename": "english springer"
    },
    {
        "cname": "威尔斯激飞猎犬",
        "description": "威尔斯激飞猎犬是一种独特而古老的品种，他的得名是因为他的捕猎本领，而不是与其他有什么关联。他是一种有魅力的狗，身材灵便，显得壮实而不粗糙。他的身材紧凑，腿不是很长，其结构明确显示出能完成艰苦的工作，且耐力持久。",
        "link": "http://www.baike.com/wiki/%E5%A8%81%E5%B0%94%E6%96%AF%E6%BF%80%E9%A3%9E%E7%8C%8E%E7%8A%AC",
        "label": "n02102177",
        "ename": "welsh springer spaniel"
    },
    {
        "cname": "可卡犬",
        "description": "可卡犬又名猎鹬犬，犬种可分为英国可卡犬和美国可卡犬，其祖先为西班牙猎犬。最初可卡犬由西班牙传入英国，用于捕猎禽类，而后带到美国被大量繁殖和改良，变为现在体型较小的两种可卡犬 [1]  。\n可卡犬具有结实紧凑的身体与轮廓分明且精致的头部。身体结实，整体匀称。其前腿直立支撑肩部，而背部的形状是由肩开始稍向肌肉发达的后躯倾斜。在它们运动时既有速度又有耐力。性格自由活泼，性情平稳，没有羞怯的迹象。",
        "link": "https://baike.baidu.com/item/%E5%8F%AF%E5%8D%A1%E7%8A%AC/1200981?fromtitle=%E5%8F%AF%E5%8D%A1&fromid=123782",
        "label": "n02102318",
        "ename": "cocker spaniel"
    },
    {
        "cname": "萨塞克斯猎犬",
        "description": "西班牙最古老的猎犬之一，1800年首次出现在英国萨克塞斯县。体型比其它猎犬矮而长，跑步的速度也比较慢。头骨宽，两耳之间有适度曲线。脸深凹，眉头上有皱纹，性格温顺。\n",
        "link": "https://bkso.baidu.com/item/%E8%90%A8%E5%A1%9E%E5%85%8B%E6%96%AF%E7%8C%8E%E7%8A%AC",
        "label": "n02102480",
        "ename": "sussex spaniel"
    },
    {
        "cname": "爱尔兰水猎犬",
        "description": "爱尔兰水猎犬是一种漂亮的、结构坚固的运动犬，非常聪明，结合了耐力和胆大的性格，活跃、热情的气质。独特的特征在于顶髻上长而松散的卷毛，身躯上覆盖着浓密、清晰的肝色卷毛，与他平滑的脸部及平滑的“老鼠”尾巴形成鲜明的对照。性情快乐、顺从、聪明，敏感而顽皮。它是猎犬中身材最魁梧的成员，善于猎取动物尤其是水禽。",
        "link": "https://baike.baidu.com/item/%E7%88%B1%E5%B0%94%E5%85%B0%E6%B0%B4%E7%8C%8E%E7%8A%AC",
        "label": "n02102973",
        "ename": "irish water spaniel"
    },
    {
        "cname": "库瓦兹犬",
        "description": "原产地匈牙利,起源于13世纪。 确实的祖先不祥，据信源于中国西藏，后经土耳其来到匈牙利，最终是在匈牙利发展成今天的库瓦兹犬。就外貌和毛色来说与马雷马牧羊犬和大白熊犬十分相像，彼此可能拥有共同的祖先。它是大型犬，但已不是古代的模样。这种犬的毛色必须是白色或象牙色。该犬品质优秀，非常聪慧，外表温文尔雅，深受儿童喜爱，是非常好的伴侣犬和护卫犬。",
        "link": "https://baike.baidu.com/item/%E5%BA%93%E7%93%A6%E5%85%B9%E7%8A%AC",
        "label": "n02104029",
        "ename": "kuvasz"
    },
    {
        "cname": "史奇派克犬",
        "description": "史奇派克犬是一种相对古老的犬类，大约有几百年的驯化历史，原产于比利时和荷兰，该品种生性忠诚仔细，主要被用作工作犬，也可担任看护、捕鼠等工作。",
        "link": "https://baike.baidu.com/item/%E5%8F%B2%E5%A5%87%E6%B4%BE%E5%85%8B%E7%8A%AC",
        "label": "n02104365",
        "ename": "schipperke"
    },
    {
        "cname": "格罗安达犬",
        "description": "格罗安达犬首先给人的印象是结实、灵活、肌肉发达、整体比例匀称，整体非常协调，身躯既不瘦长也不粗笨。身体的长度从胸骨到臀部的距离，基本与肩高相等。使人感觉有深度、可靠。头部比较长，总是很高傲的昂起，永远都保持警觉。头顶略平坦，不圆拱，宽度与长度大致相等。眼睛褐色或深褐色，中等大小，略呈杏仁状，不突出。\n",
        "link": "https://baike.baidu.com/item/%E6%A0%BC%E7%BD%97%E5%AE%89%E8%BE%BE%E7%8A%AC",
        "label": "n02105056",
        "ename": "groenendael"
    },
    {
        "cname": "比利时玛连莱犬",
        "description": "比利时玛连莱犬，是比利时牧羊犬四个类型中唯一短毛的一种，是久负盛名的古老品种，发源于比利时北部城市梅赫伦附近，由比利时兽医学院费比特兄弟于1891年选育成功。在美国及北美洲普遍把该类型犬当作一个品种看待。\n\n玛连莱犬由于具有服从性好、兴奋持久、警觉性高、嗅觉灵敏、胆大凶猛、攻击力强、探求反射特出、衔取欲望高、弹跳力好等突出的警用性能。在欧洲的法国、荷兰、比利时等国马里努阿犬占到警犬总数的60%一70%，广泛应用于追踪、缉毒、警戒、安检、护卫、押解等，在美国被普遍用于搜索、护卫等。就是在德国牧羊犬的故乡德国也大量使用玛连莱犬，打破了德国牧羊犬垄断工作犬天下的局面。",
        "link": "https://zh.wikipedia.org/wiki/%E6%AF%94%E5%88%A9%E6%99%82%E7%91%AA%E9%80%A3%E8%90%8A%E7%8A%AC",
        "label": "n02105162",
        "ename": "malinois"
    },
    {
        "cname": "伯瑞犬",
        "description": "伯瑞犬是一种英俊的狗。英文名为：Briard，别名：布里牧羊犬，原产地：法国伯瑞区。它精力旺盛且警惕，强壮但不粗糙，骨骼强健、肌肉发达，显示出作为牧羊犬所必须的力量和敏捷。适应城市生活；能适应寒冷的气候；需要经常梳理被毛；不容易与别的犬相处，会麻烦，是优秀的守门犬；毛色有肝和黑色，被毛较长需要定期整理，掌握常见的犬病及繁殖行为可是狗狗更健康的成长。",
        "link": "https://baike.baidu.com/item/%E4%BC%AF%E7%91%9E%E7%8A%AC",
        "label": "n02105251",
        "ename": "briard"
    },
    {
        "cname": "澳大利亚卡尔比犬",
        "description": "原产地澳大利亚，起源于19世纪。",
        "link": "https://baike.baidu.com/item/%E6%BE%B3%E5%A4%A7%E5%88%A9%E4%BA%9A%E5%8D%A1%E5%B0%94%E6%AF%94%E7%8A%AC",
        "label": "n02105412",
        "ename": "kelpie"
    },
    {
        "cname": "可蒙犬",
        "description": "一种牲畜护卫犬种，原产于匈牙利，又称匈牙利牧羊犬（英语：Hungarian sheepdog）。因其毛长如拖把，而亦有拖把狗之称。最早作为牧羊犬的一种。由钦察人带至欧洲，在1544年的匈牙利古抄本中首度提及这种狗。为古老犬种之一。被视为獒犬之后代，直至1920年代作出犬种认定标准。",
        "link": "https://zh.wikipedia.org/wiki/%E5%8F%AF%E8%92%99%E7%8A%AC",
        "label": "n02105505",
        "ename": "komondor"
    },
    {
        "cname": "英国古代牧羊犬",
        "description": "英国古代牧羊犬是一种以放牧家畜和宠物为目的而培育的犬种。英国古代牧羊犬的特征是灰白的长毛和头上盖眼的毛发。\n\n幼犬出生时的全身覆盖着熊猫般的纯黑和纯白色短毛，只有在退去幼毛之后，银灰色的长毛才会出现。若在法律允许的国家，通常古代牧羊犬的尾巴，会在幼犬时于第一个尾关节处切断。这种手续会产生类似熊猫的尾部，英文称作bobbing 或 docking。因为许多国家禁止这种习惯的关系，没有断尾的古代牧羊犬，反而越来越常见。目前英国养狗俱乐部并不鼓励合法切除古代牧羊犬的尾巴，只规定参展犬才需要断尾。",
        "link": "https://zh.wikipedia.org/wiki/%E8%8B%B1%E5%9C%8B%E5%8F%A4%E4%BB%A3%E7%89%A7%E7%BE%8A%E7%8A%AC",
        "label": "n02105641",
        "ename": "old english sheepdog"
    },
    {
        "cname": "喜乐蒂牧羊犬",
        "description": "喜乐蒂牧羊犬（英语：Sheltie），也称谢德兰牧羊犬（英语：Shetland Sheepdog），产于英国苏格兰昔德兰群岛。其品种的源头可能来自于苏格兰牧羊犬与狐狸狗杂交而成，也可能是苏格兰牧羊犬与查理王小猎犬混种的结果[1]。喜乐蒂牧羊犬属工作犬种，是一种在严苛环境中生活的犬种，主要担任赶羊群及守卫工作，是很活跃的牧羊犬。",
        "link": "https://zh.wikipedia.org/wiki/%E5%96%9C%E6%A8%82%E8%92%82%E7%89%A7%E7%BE%8A%E7%8A%AC",
        "label": "n02105855",
        "ename": "shetland sheepdog"
    },
    {
        "cname": "柯利犬",
        "description": "柯利犬（英语：collie）是一种特别的牧羊犬，由苏格兰和北英格兰发源，通常体型中等、体重较轻并有尖尖的嘴，十分活跃、敏捷。",
        "link": "https://zh.wikipedia.org/wiki/%E6%9F%AF%E5%88%A9%E7%8A%AC",
        "label": "n02106030",
        "ename": "collie"
    },
    {
        "cname": "边境牧羊犬",
        "description": "边境牧羊犬（英语：Border Collie）是一种原产自苏格兰的牧羊犬，主要协助农场放牧，懂得用眼神控制羊群，是最普遍的苏格兰牧羊犬犬种。边境牧羊犬以精力旺盛，体格精实且容易学习杂技运动而闻名，可是有时候太过兴奋会产生一些神经质。他们被学界认为是最聪明的犬种，也就是全球最聪明的犬种。智商大约等同六、七岁小孩的智商，所以在犬类竞技与牧羊犬竞赛中往往表现亮眼，占有优势。",
        "link": "https://zh.wikipedia.org/wiki/%E8%BE%B9%E5%A2%83%E7%89%A7%E7%BE%8A%E7%8A%AC",
        "label": "n02106166",
        "ename": "border collie"
    },
    {
        "cname": "法兰德斯畜牧犬",
        "description": "法兰德斯畜牧犬是一种结构有力、紧凑、结合短、被毛粗糙的狗，非常显著的粗糙被毛是其主要外貌特征。给人的印象是非常有力量，但在整体结构上没有任何沉重或笨拙迹象。非常灵活、英勇、且大胆，但显示出来的却是平静、良好的行为举止，显示出稳定的性格、坚定的意志和勇敢的品格。眼神警惕而有才气，显示出聪明、活力和胆略。",
        "link": "https://baike.baidu.com/item/%E6%B3%95%E5%85%B0%E5%BE%B7%E6%96%AF%E7%95%9C%E7%89%A7%E7%8A%AC",
        "label": "n02106382",
        "ename": "bouvier des flandres"
    },
    {
        "cname": "罗威纳犬",
        "description": "罗威纳犬（拉丁学名：rottweiler），是犬科犬属下的动物，犬身体强壮，动作迅猛，气势强悍，是世界上最具有勇气和力量的犬种之一。\n罗威纳犬曾经被用于看守牛群，是聪明强壮极易亲近的犬种。现在在警犬方面，广受好评，同时亦可成为极有身价的家庭犬。罗威纳犬为杰出的警犬，能攻击侵入者。为了保证本犬种会一定服从命令，饲养者应严格的训练，罗威纳犬生来具有警卫才能，中世纪时，有钱的商人们为了避免钱财被盗，便把钱袋挂在罗威纳犬颈部上。此犬个性沉稳，极富感情，也可做家庭伴侣犬。",
        "link": "https://baike.baidu.com/item/%E7%BD%97%E5%A8%81%E7%BA%B3%E7%8A%AC?fr=aladdin",
        "label": "n02106550",
        "ename": "rottweiler"
    },
    {
        "cname": "德国牧羊犬",
        "description": "德国牧羊犬，别名德国黑背（贝），也就是人们常说的——德国狼犬，此犬种据说原产德国，唯一能够确认的就是，于1880年此犬已经在德国各地固定下来，并做为牧羊犬使用。他们敏捷，且适合动作式的工作环境，它们经常被部署各种任务。而后于第一次世界大战期间被德军募集，做为军犬随军。由德军取长补短培育后，基本定型。因为体型高大，外观威猛，且具备极强的工作能力，因此在全世界范围以军犬、警犬、搜救犬、导盲犬、牧羊犬、观赏犬，以及家养宠物犬等身份活跃。",
        "link": "https://baike.baidu.com/item/%E5%BE%B7%E5%9B%BD%E7%89%A7%E7%BE%8A%E7%8A%AC/82321?fromtitle=German%20Shepherd&fromid=12003141&fr=aladdin",
        "label": "n02106662",
        "ename": "german shepherd"
    },
    {
        "cname": "杜宾犬",
        "description": "杜宾犬即笃宾犬。原产德国，它是根据培育这一品系人的名字路易斯·杜宾曼先生命名的，是所有品系中极富智慧的并且身体结构最为优秀，气质最为高贵的一种。\n杜宾犬是军、警两用的犬只，同时国内也有部分人将未裁耳、断尾的杜宾当做猎犬使用。在国内杜宾犬通常被用于护卫和狩猎。杜宾犬在饲养过程中最重要的问题就是耳朵方面的问题，杜宾犬的护理很简单，杜宾犬是要求做剪耳的，耳朵做的好坏决定了这条杜宾犬的相貌与气质。养犬人士了解常见的犬病和繁殖行为对犬和养犬人士自身也是很有必要的。",
        "link": "https://baike.baidu.com/item/%E6%9D%9C%E5%AE%BE%E7%8A%AC/1482770?fromtitle=%E6%9D%9C%E5%AE%BE%E7%8B%97&fromid=1061567&fr=aladdin",
        "label": "n02107142",
        "ename": "doberman"
    },
    {
        "cname": "迷你杜宾犬",
        "description": "迷你杜宾犬原产德国，在许多近代名画中都有其风采，现已普及欧美各国。体型娇小，被毛短硬，光华，颜色有黑褐色和黄褐色，其中颊，唇，下颚，咽喉部，前肢下半部和后肢内侧处呈黄褐色。体高25~30厘米，体重3~5千克。头盖略园，吻部细长，耳大，直立，眼呈椭圆形，色黑明亮。前肢直立，后肢结实。尾跟高，尾直立，常断尾。该犬活泼好动，行动敏捷，被人们广泛用作玩赏。\n迷你杜宾犬活泼、开朗、强壮。行走的姿态昂首阔步，美国的犬迷们为此非常喜爱。1900年前，在德国地区的这类狗曾是默默无闻的品种。虽然外形有点像杜宾犬小型犬类，但与其没有遗传上的任何关系。迷你杜宾犬学名叫迷你品，和小鹿犬不是一个品种。\n迷你犬的外形像极了英国玩具狗，不过若仔细审视，可以发现前者尾巴，但是自尊心相当强烈，避免用过度严厉的口气责备它。虽然它不嗜吠叫，但警觉性仍然相当。",
        "link": "https://baike.baidu.com/item/%E8%BF%B7%E4%BD%A0%E6%9D%9C%E5%AE%BE%E7%8A%AC/8302332?fromtitle=Miniature%20Pinscher&fromid=11249364&fr=aladdin",
        "label": "n02107312",
        "ename": "miniature pinscher"
    },
    {
        "cname": "大瑞士山地犬",
        "description": "大瑞士山地犬的英文名为：Greater Swiss Mountain Dog，原产地：瑞士。属于工作犬。是一种显眼的、三色、巨大、有力的，而且外观坚定的狗。在四种瑞士山地犬中体型最大，有光滑平顺的毛与始终拖在背后的长尾巴。",
        "link": "https://baike.baidu.com/item/%E5%A4%A7%E7%91%9E%E5%A3%AB%E5%B1%B1%E5%9C%B0%E7%8A%AC",
        "label": "n02107574",
        "ename": "greater swiss mountain dog"
    },
    {
        "cname": "伯恩山犬",
        "description": "伯恩山犬，英文名BerneseMountainDog。属于大型犬，三色、长腿。坚定而和谐，很聪明、结实且灵活，在山区足以胜任象拖曳或驱赶畜群这样的工作，这也是这一品种的起源。公狗显得雄壮、母狗则显得柔和。原产地在欧洲，历史上曾经是牧羊人的最佳帮手，时过境迁，现在又成为受人喜爱的玩赏犬。初期在瑞士伯恩地区是以拉货，乳酪制造，织布店拉车而逐渐发展起来的品种。\n伯恩山犬的被毛有长、短两种，上毛均稠、质地中等，下毛短而柔软，毛色为黑白棕。耳大小适中，尾中等长，下垂，兴奋时翘起。此犬气质是自信、警惕及和善，不神经质或害羞。伯恩山犬面对陌生人，会坚定地站在原处，保持冷淡。非常聪明，而且耐力好，不好斗，忠实易驯，也是优良的家庭犬。",
        "link": "https://baike.baidu.com/item/%E4%BC%AF%E6%81%A9%E5%B1%B1%E7%8A%AC",
        "label": "n02107683",
        "ename": "bernese mountain dog"
    },
    {
        "cname": "阿彭策尔山犬",
        "description": "阿彭策尔山犬是一种具有多种用途的犬种，脚部具有很强的耐受性，自中世纪以来，它一直是瑞士牧民多才多艺的朋友。据历史记载，这种强壮的犬在集市上曾被用来拉车和拖运货物。它是一种优良的牧羊犬，愿意与绵羊、山羊和牛群一起生活。它也是一种效能高的护卫犬，凭借其强健的体魄、大力气以及洪亮的声音来吓走入侵者。在19世纪，阿彭策尔山犬的数量大大减少，尽管它从濒于灭绝中得到挽救，但在瑞士以外的其他地方仍很少见。",
        "link": "https://baike.baidu.com/item/%E9%98%BF%E5%BD%AD%E7%AD%96%E5%B0%94%E5%B1%B1%E7%8A%AC",
        "label": "n02107908",
        "ename": "appenzeller"
    },
    {
        "cname": "恩特雷布赫山地犬",
        "description": "恩特雷布赫山地犬属于中型犬，起源于瑞士22州之一的琉森州（Lucerne）。恩特雷布赫山犬主要是保护驱赶畜牧群，特别是在险峻的山区，是牛棚、马厩、茅舍和家园的忠实守护神。",
        "link": "https://baike.baidu.com/item/%E6%81%A9%E7%89%B9%E9%9B%B7%E5%B8%83%E8%B5%AB%E5%B1%B1%E5%9C%B0%E7%8A%AC/12590742?fr=aladdin",
        "label": "n02108000",
        "ename": "entlebucher"
    },
    {
        "cname": "拳师犬",
        "description": "拳师犬，原产地德国，体形外貌漂亮强健。头和身体很相称，鼻大而黑。耳生长位置较高，常人工切去耳尖。眼黑色。颈圆柱形很强壮，富有肌肉，无下垂皮肤。躯体呈正方形，尾巴人工切除（欧洲等国，人性化开始留尾，留耳），尾短，始终高举。前肢直立、平行。忠诚，不记仇。尤其对儿童富有感情，易训练，可用作警犬、护卫犬、个人警卫犬，也可用于导盲犬。由于其服从性好，也是一个很好的伴侣犬。",
        "link": "https://baike.baidu.com/item/%E6%8B%B3%E5%B8%88%E7%8A%AC/504465?fr=aladdin",
        "label": "n02108089",
        "ename": "boxer"
    },
    {
        "cname": "斗牛獒",
        "description": "斗牛獒犬原产于英国，是由斗牛犬和獒犬杂交培育而成。斗牛獒体型匀称、外表威严、体格有力。 属大型犬种，肩高 60cm 以上，体重 45- 60kg。 该犬种身体匀称，结实而灵活，有很强的力量和耐力，嗅觉敏锐，支配欲强，长得或许有点可爱，但却极具攻击性，其主要用途是担当护卫和狩猎的职责。",
        "link": "https://baike.baidu.com/item/%E6%96%97%E7%89%9B%E7%8D%92/528575?fromtitle=BULL%20MASTIFF&fromid=11284437&fr=aladdin",
        "label": "n02108422",
        "ename": "bull mastiff"
    },
    {
        "cname": "藏獒",
        "description": "藏獒（英语：Tibetan Mastiff），又名西藏獒犬，属獒犬类，是一种体型较大性格凶猛的犬。其毛色多为铁包金、黄色、黑色（黑色并不是纯黑，而是在胸部、四肢略有白毛）等，原产于青藏高原。它气质刚强，尊贵而高傲，力量强大，动作敏捷矫健，耐力较差，幼犬在成年以前记忆力较差。本品种的典型特征是警觉性高，领地意识极强，对主人极为忠诚，在领地内对陌生人有强烈敌意，善于保护主人及其财物。藏獒有忠心护主的天性，不仅是游牧民族的最佳保护犬，同时也被认定是国王、部落首长的最佳护卫犬。藏獒体格高大，性格刚毅，力大勇猛，野性尚存。藏獒身长约120厘米，体毛粗硬，丰厚，外层披毛不太长，底毛在寒冷的气候条件下，则浓密且软如羊毛，耐寒冷，能在冰雪中安然入睡。而在温暖的气候条件下，则非常稀少。护领地，护食物，善攻击，对陌生人有强烈敌意；虽然对主人极为亲热，但在人类生活区对公众构成严重威胁。世界最凶猛的犬种。",
        "link": "https://baike.baidu.com/item/%E6%B3%95%E5%85%B0%E5%BE%B7%E6%96%AF%E7%95%9C%E7%89%A7%E7%8A%AC",
        "label": "n02108551",
        "ename": "tibetan mastiff"
    },
    {
        "cname": "法国斗牛犬",
        "description": "法国斗牛犬（French bulldog）是一种活泼、聪明、肌肉发达的狗，骨骼沉重，背毛平滑、结构紧凑，体型中等或较小。表情显得警惕、好奇而感兴趣。法国斗牛犬亲切，敦厚，忠诚，执著，勇敢，具有独特的品位，而且完全表露于表情与动作。对小孩和善，同时也是作风彪悍，能力强，对于新鲜事物有极强的好奇心的优秀玩具犬。",
        "link": "https://baike.baidu.com/item/%E6%B3%95%E5%9B%BD%E6%96%97%E7%89%9B%E7%8A%AC/277646?fr=aladdin",
        "label": "n02108915",
        "ename": "french bulldog"
    },
    {
        "cname": "大丹犬",
        "description": "大丹犬也称做大丹狗、德国獒曾被欧洲王室及贵族饲养，是贵族身份地位的象征，体高一般为70~90公分，体重为50~70公斤。毛短厚而富有光泽，头大而窄长，毛呈黄褐、虎斑、蓝色，黑色或黑白花色等。\n外表高贵优雅，体形大，肌肉丰满，强壮有力。在大型的工作犬中，是唯一体态匀称，可以轻松长途跋涉的犬。人们称它为太阳神的犬。在养犬中掌握常见的犬病和繁殖行为，对犬和养犬人士都是很重要的。",
        "link": "https://baike.baidu.com/item/%E5%A4%A7%E4%B8%B9%E7%8A%AC",
        "label": "n02109047",
        "ename": "great dane"
    },
    {
        "cname": "圣伯纳犬",
        "description": "圣伯纳犬（saint bernard），又名（圣伯纳德犬）原产瑞士，被称为瑞士的国宝，在丹麦也有悠久的历史，但19世纪中叶，数量越来越少几乎到了灭种的地步。\n体重能达90公斤，身高可达90CM。堪称世界上体型最大的犬种之一，是世界上平均体重最重的犬种之一。\n圣伯纳犬个性十分温顺，容易亲近，对小朋友十分宽容。它忠于主人，容易训练。如果给予足够的空间、食物、运动量，就可以成为很好的家庭犬。",
        "link": "https://baike.baidu.com/item/%E5%9C%A3%E4%BC%AF%E7%BA%B3%E7%8A%AC/1037285?fromtitle=saint%20bernard&fromid=11312939&fr=aladdin",
        "label": "n02109525",
        "ename": "saint bernard"
    },
    {
        "cname": "爱斯基摩犬",
        "description": "公元前1000年发源于北极陆地，有多种颜色的毛皮，耳朵竖起，长长的尾巴卷曲在背上。浓密的皮毛能够抵御低于冰点的温度。机械化出现之前是生活在极地居民的最重要交通运输工具。",
        "link": "https://baike.baidu.com/item/%E7%88%B1%E6%96%AF%E5%9F%BA%E6%91%A9%E7%8A%AC/447333?fr=aladdin",
        "label": "n02109961",
        "ename": "eskimo dog"
    },
    {
        "cname": "阿拉斯加雪橇犬",
        "description": "阿拉斯加雪橇犬也叫阿拉斯加犬，是最古老的极地雪橇犬之一，它的名字取自爱斯基摩人的伊努伊特族的一个叫做马拉缪特的部落。这个部落生活在阿拉斯加西部一个叫做科策布(Kotzebue)的岸边。成年阿拉斯加犬有着安静、高雅的气质，对主人非常忠心。",
        "link": "https://baike.baidu.com/item/%E9%98%BF%E6%8B%89%E6%96%AF%E5%8A%A0%E9%9B%AA%E6%A9%87%E7%8A%AC",
        "label": "n02110063",
        "ename": "malamute"
    },
    {
        "cname": "西伯利亚雪橇犬",
        "description": "西伯利亚雪橇犬（俄语：Сибирский хаски，英语：Siberian husky），常见别名哈士奇，昵称为二哈。西伯利亚雪橇犬体重介于雄犬20-27公斤，雌犬16-23公斤，身高大约雄犬肩高53-58厘米，雌犬51-56厘米，是一种中型犬。\n西伯利亚雪橇犬是原始的古老犬种，在西伯利亚东北部、格陵兰南部生活。哈士奇名字的由来，是源自其独特的嘶哑声。哈士奇性格多变，有的极端胆小，也有的极端暴力，进入大陆和家庭的哈士奇，都已经没有了这种极端的性格，比较温顺，是一种流行于全球的宠物犬。与金毛犬、拉布拉多并列为三大无攻击型犬类。被世界各地广泛饲养，并在全球范围内，有大量该犬种的赛事。",
        "link": "https://baike.baidu.com/item/%E8%A5%BF%E4%BC%AF%E5%88%A9%E4%BA%9A%E9%9B%AA%E6%A9%87%E7%8A%AC/540855?fromtitle=%E5%93%88%E5%A3%AB%E5%A5%87&fromid=123197",
        "label": "n02110185",
        "ename": "siberian husky"
    },
    {
        "cname": "艾芬品",
        "description": "艾芬品是一种匀称的，长有象梗类犬那样刚毛的玩具犬，很聪明，而且有风度，是一种非常好的室内宠物。这种犬源自德国，它的名字“Affenpinscher”的意思是指“象猴子那样的梗类犬”，这一品种是为了在厨房、谷仓抓捕啮齿类动物（如老鼠）而培养的。 在法国，这一品种被形容成\"Diablotin Moustachu\" 或长胡子的小恶魔。两种形容都提及了这种招人喜欢的品种的外貌和气质。艾芬品的整体特征要比某单一的特点要重要的多，它的整体外观应该是整洁而有很多粗硬的毛。",
        "link": "https://baike.baidu.com/item/%E7%8C%B4%E7%8A%AC/6813870?fr=aladdin",
        "label": "n02110627",
        "ename": "affenpinscher"
    },
    {
        "cname": "巴仙吉犬",
        "description": "巴仙吉犬，英文名Basenji，属于狩猎犬。巴仙吉犬源于非洲则为小型的短毛猎犬。背部短，且身体结构显得十分轻盈，对于此犬的长度来说，其腿显得略长一些。头部长有皱纹，且高傲地昂着，圆拱的颈部支撑着头部，尾巴位于臀部较高的位置，且呈卷曲的。具有文雅而优美的气质，显得和谐而好奇且充满机警。由于整体的身躯保持平衡，肌肉组织很平滑，因此导致具有轻松而敏捷的动作。巴仙吉犬通过本身所具备的视觉与嗅觉而用来狩猎。",
        "link": "https://baike.baidu.com/item/%E5%B7%B4%E4%BB%99%E5%90%89%E7%8A%AC/2019883?fromtitle=Basenji&fromid=11284600&fr=aladdin",
        "label": "n02110806",
        "ename": "basenji"
    },
    {
        "cname": "巴哥犬",
        "description": "巴哥犬（pug），原产于中国，富有魅力而且高雅，14世纪末正式命名为“巴哥”其词意古语为“锤头”、“小丑”，狮子鼻或小猴子的意思。巴哥犬容易有睫毛倒插的毛病，头部皱折多，也容易泪管阻塞，而有两条明显的泪痕。巴哥犬是体贴，可爱的小型犬种，不需要运动或经常整理背毛，但需要同伴。容貌皱纹较多，走起路来象拳击手是其特征。它是以咕噜的呼吸声及像马一样抽鼻子的声音作为沟通的方式。同时，此犬具备优良及爱干净的个性，这些特色便成为广受喜爱的原因。",
        "link": "https://baike.baidu.com/item/%E5%B7%B4%E5%93%A5%E7%8A%AC",
        "label": "n02110958",
        "ename": "pug"
    },
    {
        "cname": "兰波格犬",
        "description": "兰波格犬，或译做兰伯格犬，原产地德国，用圣伯纳犬与纽芬兰犬、大白熊犬交配，并几经挑选培育而成。体高65～80厘米，体重大约40～60千克。此犬体型高大、肌肉结实、强壮有力，带有威武雄壮的气派。智慧灵敏，感情深厚，神情亲切和善，喜欢孩子，服从性强。",
        "link": "https://baike.baidu.com/item/%E5%85%B0%E6%B3%A2%E6%A0%BC%E7%8A%AC",
        "label": "n02111129",
        "ename": "leonberg"
    },
    {
        "cname": "纽芬兰犬",
        "description": "纽芬兰犬发现在加拿大东北部的纽芬兰地区。一些人认为纽芬兰犬是印第安野狗的后代，另一些人则认为它们同加拿大拉布拉多犬血缘相近。因为纽芬兰和拉布拉多的海岸线紧邻，拉布拉多犬是优秀的游泳能手，能够游到纽芬兰。\n纽芬兰犬Newfoundland，原产加拿大东海岸纽芬兰岛，据说祖先有大白熊犬或雪橇犬的血统。属大型犬，但性情温和，且不会表现得迟钝或暴躁。它们不但是忠实的伴侣，而且更是多用途的犬只。甜蜜可爱是纽芬兰犬最大的特点。",
        "link": "https://baike.baidu.com/item/%E7%BA%BD%E8%8A%AC%E5%85%B0%E7%8A%AC/528501?fr=aladdin",
        "label": "n02111277",
        "ename": "newfoundland"
    },
    {
        "cname": "大白熊犬",
        "description": "大白熊犬，动物界，脊椎动物亚门，别名比利牛斯山地犬（Pyrenean Mountain Dog）。其身体健壮而协调，美丽高雅，庄严雄伟，有帝王般的仪态。\n它充满自信、温和友善（个别的性格暴躁）、沉着耐心、责任心强、忠诚勇敢，是当今最有力量的犬种，在各种气候条件下都能忠诚地坚守工作岗位。大白熊犬历史可追溯到古罗马时期，由古罗马人带到西班牙的犬种。",
        "link": "https://baike.baidu.com/item/%E5%A4%A7%E7%99%BD%E7%86%8A%E7%8A%AC/524686?fr=aladdin",
        "label": "n02111500",
        "ename": "great pyrenees"
    },
    {
        "cname": "萨摩耶犬",
        "description": "萨摩耶犬（英文：Samoyed），别称萨摩耶，原是西伯利亚的原住民萨摩耶族培育出的犬种，一岁前调皮、灵动。它机警、强壮、灵活、美丽、高贵优雅、乖巧可爱，有着非常引人注目的外表，有“微笑天使”的称号，也有着“微笑天使面孔，捣蛋魔鬼内心”之称。萨摩耶犬的颜色为白色；部分带有很浅的浅棕色、奶酪色、浅棕色。此外其他颜色都属于失格。世界上曾出现过一只灰白色萨摩，FCI承认他是具有纯种血统萨摩耶基因的返祖萨摩，黑色萨摩耶犬极为罕见。",
        "link": "https://baike.baidu.com/item/%E8%90%A8%E6%91%A9%E8%80%B6%E7%8A%AC/6397?fromtitle=samoyed&fromid=1786546&fr=aladdin",
        "label": "n02111889",
        "ename": "samoyed"
    },
    {
        "cname": "博美犬",
        "description": "博美是一种紧凑、短背、活跃的玩赏犬，学名哈多利系博美犬（俗称英系博美犬），是德国狐狸犬的一种，原产德国。它拥有柔软、浓密的底毛和粗硬的皮毛。尾根位置很高，长有浓密饰毛的尾巴卷放在背上。它具有警惕的性格、聪明的表情、轻快的举止和好奇的天性。体型小巧可爱，适合当伴侣犬，白色和棕色的居多。德国狐狸犬，包括荷兰毛狮犬，大型狐狸犬，中型狐狸犬，小型狐狸犬和松鼠犬（也就是博美犬），同时也是很有竞争力的比赛犬。其毛色有白、偏黄奶油、花色、黑、红、棕等。",
        "link": "https://baike.baidu.com/item/%E5%8D%9A%E7%BE%8E%E7%8A%AC",
        "label": "n02112018",
        "ename": "pomeranian"
    },
    {
        "cname": "松狮犬",
        "description": "松狮犬是原产中国西藏的古老犬种，至少已经有2000年的历史。汉朝有些文物中也可见到。真正的名字是獢獢，松狮是进入到外国，又传回中国的名字。\n英文Chow Chow，常常简称为Chow，是一种非常古老的品种，可能因其头部酷似雄狮而得名；松狮犬集美丽、高贵和自然于一身，一脸典型的悲苦表情更添情趣。现在松狮犬可爱的外表已被人视作理想的家居宠物，主要作为伴侣犬。体重约20kg，身高约50厘米；性格较温顺，可作为狩猎犬、拖曳犬、护卫犬、伴侣犬使用。",
        "link": "https://baike.baidu.com/item/%E6%9D%BE%E7%8B%AE%E7%8A%AC/223935",
        "label": "n02112137",
        "ename": "chow"
    },
    {
        "cname": "荷兰毛狮犬",
        "description": "荷兰毛狮犬的性情很开朗，特别容易与人亲近，有着非常好的记忆力，善于对事物进行观察，是一个出色的警卫犬。体型比较大，但并不占地方，乘坐荷兰船的这类祖先犬，习惯的把身子蜷缩成一个圆形，是为了不占地方。荷兰毛狮犬对自己的饲主非常忠心，给饲养者带来无尽的欢乐。尽管几百年以来荷兰狮毛犬（也有人译作“凯斯犬”）一直是荷兰人民最喜爱的犬之一，但是直到18世纪后半叶由于荷兰国内政治的翻转它才引起人们的广泛关注。荷兰狮毛犬从来没有用来作狩猎犬，荷兰狮毛犬以它的品格魅力，在一个民族的情感中赢得了一个很高的地位。",
        "link": "https://baike.baidu.com/item/%E8%8D%B7%E5%85%B0%E6%AF%9B%E7%8B%AE%E7%8A%AC",
        "label": "n02112350",
        "ename": "keeshond"
    },
    {
        "cname": "布鲁塞尔格林芬犬",
        "description": "布鲁塞尔格林芬犬（Griffon Bruxellois）是一种短小精悍，强壮。胸部宽而深，背短、后半身特别发达的犬种。前肢直挺，后肢发达，颈部力道强劲，微拱，前脸部特短，眼睛大而黑，眼睛四周也是同色，突显锐利机灵的神情。突出的下颚，表现出独立性强的性格。嘴唇宽，稍微上翘，耳根的位置高、断耳，或维持自然原状。尾巴剪短。",
        "link": "https://zh.wikipedia.org/wiki/%E5%B8%83%E9%AD%AF%E5%A1%9E%E7%88%BE%E6%A0%BC%E6%9E%97%E8%8A%AC%E7%8A%AC",
        "label": "n02112706",
        "ename": "brabancon griffon"
    },
    {
        "cname": "彭布罗克威尔士柯基犬",
        "description": "彭布罗克威尔士柯基犬低矮，强壮，结实而活跃，给人印象身体所占空间位置小。但身体不能太矮，骨头不能太重，否则会显得粗糙、多余，也不能太轻，否则会显得太活跃。外观勇敢，和蔼，表情显得聪明，对外界感兴趣。既不胆怯也不凶恶。 恰当的平衡性与轮廓、有魅力的脑袋、聪明的神态与合适的性情是首要条件。犬的运动状态也是很重要的，尤其是从一侧观察。步态平滑自如的犬是较理想犬，应受到高度重视。在以上所介绍的特点中，不应有任何小的缺点。",
        "link": "https://baike.baidu.com/item/%E5%BD%AD%E5%B8%83%E7%BD%97%E5%85%8B%E5%A8%81%E5%B0%94%E5%A3%AB%E6%9F%AF%E5%9F%BA%E7%8A%AC/1865624?fr=aladdin",
        "label": "n02113023",
        "ename": "pembroke"
    },
    {
        "cname": "威尔士柯基犬",
        "description": "威尔士柯基犬（又名柯基犬；英语：Welsh Corgi，复数型可为corgis或辞源一致的corgwn。corgi在威尔士文中意为矮狗）是牧羊犬中的一个品种，原产于英国威尔士。当前获承认的有两个不同品种：卡提根（Cardigan） 和潘布鲁克（Pembroke）。历史上一般认为潘布鲁克源自于10世纪左右佛兰德纺织者引进的狗，而卡提根则是源于诺尔斯定居者带来的狗，特别是其共同祖先瑞典牧羊犬。这两种有时会用杂交来解释其相似之处。\n\n威尔士柯基犬平均肩高大约25至30公分、重约15公斤，原本培养来放牧牛羊，低矮的身材让他们免于被牛只踢到。柯基犬是主动的犬只并且相当的聪明，是绝佳的伙伴动物，并且在牧羊竞赛跟犬只敏捷竞赛中是出色的参赛者。",
        "link": "https://zh.wikipedia.org/wiki/%E5%A8%81%E7%88%BE%E6%96%AF%E6%9F%AF%E5%9F%BA%E7%8A%AC",
        "label": "n02113186",
        "ename": "cardigan"
    },
    {
        "cname": "玩具贵宾犬",
        "description": "玩具贵宾犬是一种敏捷、聪明而、优雅的宠物犬，长方形体型、比例匀称，步伐有力而自信，是服从性竞赛中的强手。它们的毛质和外观独特，在展会上常被修剪成狮子的模样，其实它们需要按传统方式修剪和精心美容，使它具有与众不同的神态和特有的高贵姿态。这种犬可爱而长寿，但有时很吵闹，很萌，而且是儿童比较喜欢的宠物。此外，购买时要注意狗狗有没有各类疾病。",
        "link": "https://baike.baidu.com/item/%E7%8E%A9%E5%85%B7%E8%B4%B5%E5%AE%BE%E7%8A%AC/6518976?fr=aladdin",
        "label": "n02113624",
        "ename": "toy poodle"
    },
    {
        "cname": "迷你贵宾狗",
        "description": "迷你贵宾狗 英文名称：Miniature Poodle体型分类：小型 犬种分类：玩赏犬 历史：原产法国。是世界上第二聪明的狗狗，仅次于边境牧羊犬",
        "link": "https://baike.baidu.com/item/%E8%BF%B7%E4%BD%A0%E8%B4%B5%E5%AE%BE%E7%8B%97/632339?fr=aladdin",
        "label": "n02113712",
        "ename": "miniature poodle"
    },
    {
        "cname": "标准贵宾犬",
        "description": "贵宾犬确切起源不详。迷你贵宾和玩具贵宾可能是由标准贵宾与马耳济斯及哈威那杂交而培育出来的小形品种。在全西欧地区有四百年历史。此犬多才多艺，在任何环境都能表现出高贵的举止。标准贵宾本来是被培育成猎犬的，而迷你贵宾和玩具贵宾仅仅是伴侣犬。贵宾犬流行于路易14~路易16时期的法国宫廷，迷你贵宾和玩具贵宾则出现在17世纪的绘画中。这种狗在18~19世纪的马戏团中也十分流行。贵宾犬是19世纪末被首次介绍的美国，但直到二次大战结束后在开始流行，并将最流行品种的荣誉保持了10年",
        "link": "https://baike.baidu.com/item/%E6%A0%87%E5%87%86%E8%B4%B5%E5%AE%BE%E7%8A%AC/5881364?fr=aladdin",
        "label": "n02113799",
        "ename": "standard poodle"
    },
    {
        "cname": "墨西哥无毛犬",
        "description": "墨西哥无毛犬那粉红色、皱巴巴的皮肤上布满雀斑，身上有黄褐色毛发覆盖的地方，仅仅在血管清楚可见的两耳之间、黏糊糊的下颚，以及老鼠般的尾巴末端",
        "link": "https://baike.baidu.com/item/%E5%A2%A8%E8%A5%BF%E5%93%A5%E6%97%A0%E6%AF%9B%E7%8A%AC/632695?fromtitle=Mexican%20Hairless&fromid=11211483&fr=aladdin",
        "label": "n02113978",
        "ename": "mexican hairless"
    },
    {
        "cname": "澳洲野犬",
        "description": "分布遍及澳洲，部分分布在东南亚，澳大利亚的野犬雄性比雌性略大，秤重在11.8～19.4公斤之间，平均体长920毫米。澳洲野犬组成小群生活，群落中有严格的等级，每群只有一对有统治权的野犬能繁殖后代，其他野犬都帮助首领共同抚育幼崽",
        "link": "https://baike.baidu.com/item/dingo/7223941?fr=aladdin",
        "label": "n02115641",
        "ename": "dingo"
    },
    {
        "cname": "豺",
        "description": "豺（学名：Cuon alpinus）：有11个亚种，大小似犬而小于狼，体长85-130厘米，尾长45-50厘米，体重15-32千克。吻较狼短而头较宽，耳短而圆，身躯较狼为短。四肢较短，尾比狼略长，但不超过体长的一半，其毛长而密，略似狐尾。背毛红棕色，毛尖黑色，腹毛较浅淡。下臼齿每侧仅2枚。\n豺既能抗寒，也能耐热，但以南方有林的山地、丘陵为其主要的栖息地。群居性，少则2-3只，一般7-8只，甚至10只或结成更多只聚合成群，雄兽居多，性比为2︰1。集体猎食，常以围攻的方式，几乎在同域分布的大小兽类它们都能对付。寿命约10余岁。虽分布广泛，但数量稀少。广泛分布于整个北亚、南亚及东南亚的大陆地区。",
        "link": "https://baike.baidu.com/item/%E8%B1%BA/16506779?fromtitle=Dhole&fromid=16508932&fr=aladdin",
        "label": "n02115913",
        "ename": "dhole"
    },
    {
        "cname": "非洲野犬",
        "description": "非洲野犬（学名：Lycaon pictus）：体长100厘米，尾长30-45厘米，体重17-36千克。毛色较杂乱，包括黑色、黄色和白色等，每个个体毛色斑纹均不相同。前肢无爪。前臼齿较大，可磨碎大型骨头，类似鬣狗。群居，通过叫声进行定位。采取群体合作方式猎杀中型有蹄动物，追击时速可达45千米。全年可繁殖，多为雨季，每胎产2-19仔，通常10仔，幼仔一般在其他动物（比如土狼）的巢穴中出身，12-18个月性成熟。\n分布于非洲草原、灌木丛以及稀疏林地，主要见于非洲东部和南部部分地区。由于非洲野犬的领域面积较大，随着栖息地的减少和其他大型食肉动物的竞争，其数量不断下降，处于濒危状态，仅剩25个种群，约有3000只左右，津巴布韦西部的皇日国家公园是其保护区，列入红色目录IUNC濒危。",
        "link": "https://baike.baidu.com/item/%E9%9D%9E%E6%B4%B2%E9%87%8E%E7%8A%AC/4119706?fromtitle=%E9%9D%9E%E6%B4%B2%E7%8C%8E%E7%8A%AC&fromid=10786634&fr=aladdin",
        "label": "n02116738",
        "ename": "african hunting dog"
    }
]

// 定义数据导出
module.exports = {
  dog_list: dogs_json
}
